Repository: utopicnarwhal/utopicnarwhal.github.io
Catalog: lib/l10n/intl_*.arb
Languages: fi

# contactMeButton
source: Contact me!
fi: Ota yhteyttä!

# changeLanguageButtonTooltip
source: Change language
fi: Vaihda kieli

# copyToClipboardMessage
source: "{text}" copied to your clipboard
fi: "{text}" kopioitu leikepöydälle

# introViewGreeting
source: Hello! I’m Sergei.
fi: Hei! Olen Sergei.

# introViewMyTitleString
source: professional <link href="https://flutter.dev/">flutter</link> developer based in Helsinki, Finland
fi: ammattimainen <link href="https://flutter.dev/">flutter</link>-kehittäjä Helsingistä, Suomi

# toggleThemeModeButtonTooltip
source: Toggle theme mode
fi: Vaihda teemavaihtoehdon tila

# professionalSummaryTitle
source: Professional Summary
fi: Ammattilaisen yhteenveto

# professionalSummaryCardBodyText
source: Skilful mobile developer with 6+ years of dedicated expertise in crafting Android, iOS, and Web apps using Flutter and publishing them into the app stores. Committed to creating top-notch applications by prioritizing clean, readable code and exceptional user experiences.
fi: Kokenut mobiilikehittäjä, jolla on yli 6 vuoden omistautunut asiantuntemus Android-, iOS- ja web-sovellusten luomisessa käyttäen Flutteria ja julkaisemisessa sovelluskauppoihin. Sitoutunut luomaan huippuluokan sovelluksia asettamalla puhtaan ja luettavan koodin sekä poikkeuksellisen käyttäjäkokemuksen etusijalle.

# openCvButton
source: Open CV
fi: Katsoa CV:ta

# learnMoreButton
source: Learn more
fi: Lisätietoja

# keySkillsHeadline
source: Key skills
fi: Avainosaamiset

# hardSkillsTitle
source: Hard skills
fi: Tekniset taidot

# softSkillsTitle
source: Soft skills
fi: Ihmissuhdetaidot

# softSkillProblemSolving
source: Problem-Solving
fi: Ongelmanratkaisu

# softSkillAdaptability
source: Adaptability
fi: Sopeutumiskyky

# softSkillCommunication
source: Communication
fi: Viestintä

# softSkillTeamwork
source: Teamwork
fi: Tiimityö

# softSkillTimeManagement
source: Time Management
fi: Ajanhallinta

# softSkillCreativity
source: Creativity
fi: Luovuus

# softSkillAttentionToDetail
source: Attention to Detail
fi: Huolellisuus

# softSkillInitiative
source: Initiative
fi: Aloitteellisuus

# softSkillOpenMindedness
source: Open-Mindedness
fi: Avoin mieli

# sourceTooltip
source: Source
fi: Lähde

# projectsShowcaseHeadline
source: Projects Showcase
fi: Projektien Esittely

# flutterFrameworkTitle
source: Flutter Framework
fi: Flutter-kehys

# flutterFrameworkHardSkillBody
source: Proficiency in building mobile applications using the Flutter framework, including knowledge of architecture, theming, routing, animations, advanced scrolling, UI components, etc. By the way, this web app is also built with Flutter.
fi: Taidot rakentaa mobiilisovelluksia Flutter-kehystä käyttäen, mukaan lukien arkkitehtuuri, teema, reititys, animaatiot, edistynyt vieritys, käyttöliittymäkomponentit jne. Muuten, tämä verkkosovellus on myös rakennettu Flutterilla.

# dartProgrammingLanguageHardSkillTitle
source: Dart Programming Language
fi: Dart-ohjelmointikieli

# dartProgrammingLanguageHardSkillBody
source: Proficient with a strong command of the Dart programming language, showcasing expertise in syntax, data manipulation, object-oriented principles, functions, and efficient utilization of language features. Experienced in designing and implementing robust, performant software solutions, including frontend and backend logic as well as utility scripts, harnessing Dart's versatile capabilities.
fi: Taitava, vahva osaaminen Dart-ohjelmointikielellä, näyttäen asiantuntemusta syntaksista, datan manipuloinnista, olioperiaatteista, funktioista ja kielen ominaisuuksien tehokkaasta käytöstä. Kokemusta vankkojen ja suorituskykyisten ohjelmistoratkaisujen suunnittelusta ja toteuttamisesta, mukaan lukien frontend- ja backend-logiikka sekä apuohjelmaskriptit, hyödyntäen Dartin monipuolisia kykyjä.

# versionControlHardSkillTitle
source: Version Control
fi: Versiohallinta

# versionControlHardSkillBody
source: Knowledgeable in using version control systems like Git for collaborative development and code management. I also find great value in the user-friendly <link href="https://www.gitkraken.com/">GitKraken</link> client app for its smooth interface and powerful features.
fi: Tuntemus versionhallintajärjestelmien käytöstä, kuten Git, yhteistyöhön perustuvassa kehityksessä ja koodin hallinnassa. Arvostan myös käyttäjäystävällisen <link href="https://www.gitkraken.com/">GitKraken</link> -asiakasohjelman tuomaa sujuvaa käyttöliittymää ja tehokkaita ominaisuuksia.

# cicdHardSkillTitle
source: Continuous Integration and Continuous Delivery
fi: Jatkuva integrointi ja jatkuva toimitus

# cicdHardSkillBody
source: Familiar with the process of establishing and effectively employing CI/CD pipelines to automate key aspects of software development, including building, testing, and deploying applications. I have hands-on experience utilizing popular tools like <link href="https://circleci.com/">Circle CI</link> and <link href="https://github.com/features/actions">GitHub Actions</link> to streamline development workflows, enhance code quality through automated testing, and ensure swift and reliable deployment of software updates.
fi: Tutustuminen jatkuvaan integrointiin ja jatkuvaan toimitukseen liittyvään prosessiin, mukaan lukien CI/CD-putkien luominen ja tehokas käyttö ohjelmistokehityksen keskeisten osa-alueiden automatisoimiseksi, kuten sovellusten rakentaminen, testaus ja julkaisu. Käytännön kokemus suosittujen työkalujen, kuten <link href="https://circleci.com/">Circle CI</link> ja <link href="https://github.com/features/actions">GitHub Actions</link>, käytöstä kehitysprosessien virtaviivaistamiseksi, koodin laadun parantamiseksi automaattisella testauksella sekä varmistaakseen ohjelmistopäivitysten nopean ja luotettavan julkaisun.

# firebaseToolsHardSkillTitle
source: Firebase Tools
fi: Firebase-työkalut

# firebaseToolsHardSkillBody
source: I'm comfortable with a range of Firebase services that improve apps. This includes Firebase App Distribution, which makes sharing test versions simple, and Firebase Remote Config, allowing apps to change without updates. I'm also familiar with Analytics for insights and Cloud Messaging (FCM) for push notifications, helping me create apps with real-time updates and enhanced user engagement.
fi: Olen mukavuudella käyttänyt erilaisia Firebase-palveluita, jotka parantavat sovelluksia. Tämä sisältää Firebase App Distributionin, joka helpottaa testiversioiden jakamista, ja Firebase Remote Configin, joka mahdollistaa sovellusten muuttamisen ilman päivityksiä. Tunnen myös Analyticsin, joka tarjoaa oivalluksia, ja Cloud Messaging (FCM) -palvelun push-ilmoituksille, jotka auttavat minua luomaan sovelluksia reaaliaikaisilla päivityksillä ja parannetulla käyttäjäsitoutumuksella.

# googleMaterialDesignHardSkillBody
source: Skilled in adeptly crafting user interfaces that adhere to the foundational principles of Material Design. Leveraging its elegant and intuitive design language, I consistently deliver visually captivating and user-centric applications. My deep understanding of Material Design guidelines and best practices ensures the creation of cohesive and delightful user experiences. By thoughtfully integrating typography, color, and motion, I contribute to the development of applications that resonate with modern design sensibilities while maintaining user-friendliness.
fi: Taito luoda käyttöliittymiä, jotka noudattavat Material Designin perusperiaatteita. Hyödyntäen sen tyylikästä ja intuitiivista suunnittelukieltä, tuotan johdonmukaisesti visuaalisesti lumoavia ja käyttäjäkeskeisiä sovelluksia. Syvä ymmärrykseni Material Designin ohjeista ja parhaista käytännöistä varmistaa yhtenäisten ja ilahduttavien käyttäjäkokemusten luomisen. Huolellisesti yhdistämällä typografiaa, väriä ja liikettä osallistun sovellusten kehitykseen, jotka resonoi modernien suunnittelutottumusten kanssa säilyttäen samalla käyttäjäystävällisyyden.

# responsiveDesignHardSkillTitle
source: Responsive Design
fi: Vastuullinen suunnittelu

# responsiveDesignHardSkillBody
source: Proficient in the art of designing responsive UI layouts that seamlessly adjust to diverse screen dimensions and orientations. With a keen eye for detail and a deep understanding of design principles, I consistently develop interfaces that maintain visual coherence and functionality across various devices. This expertise also involves taking into consideration possible inputs like mouse or touch interactions, ensuring a smooth and intuitive user experience regardless of the device in use.
fi: Taitava suunnittelemaan responsiivisia käyttöliittymien ulkoasuja, jotka mukautuvat saumattomasti erilaisiin näyttökoon ja suuntaan. Tarkalla silmällä yksityiskohtiin ja syvällä ymmärryksellä suunnitteluperiaatteista kehitän jatkuvasti käyttöliittymiä, jotka säilyttävät visuaalisen yhtenäisyyden ja toimivuuden erilaisilla laitteilla. Tähän osaamiseen kuuluu myös mahdollisten syötteiden, kuten hiiren tai kosketusinteraktioiden, huomioiminen, varmistaen sujuvan ja intuitiivisen käyttökokemuksen laitteesta riippumatta.

# designSystemsHardSkillTitle
source: Design Systems
fi: Suunnittelujärjestelmät

# designSystemsHardSkillBody
source: Experience in creating, maintaining, and testing design systems, ensuring consistent visual elements, typography, and UI components across multiple projects for enhanced brand identity and streamlined development.
fi: Kokemusta suunnittelujärjestelmien luomisesta, ylläpitämisestä ja testaamisesta, varmistaen yhtenäiset visuaaliset elementit, typografian ja käyttöliittymäkomponentit useissa projekteissa parannetun brändi-identiteetin ja virtaviivaistetun kehityksen saavuttamiseksi.

# internationalizationHardSkillTitle
source: Internationalization
fi: Kansainvälistäminen

# internationalizationHardSkillBody
source: Experienced in integrating language options and localized content using the 'intl' package for Flutter apps. Used POEditor to manage translations efficiently. Skilled in utilizing '.arb' files to automatically update app interfaces and content in various languages, ensuring enhanced user-friendliness for a diverse audience.
fi: Kokemusta kieliopintojen ja lokalisoitujen sisältöjen integroinnista Flutter-sovelluksiin 'intl'-paketin avulla. Käytetty POEditoria tehokkaaseen käännösten hallintaan. Taitava '.arb'-tiedostojen käyttämisessä sovellusten käyttöliittymien ja sisällön automaattiseen päivittämiseen eri kielillä, varmistaen parannetun käyttäjäystävällisyyden monimuotoiselle yleisölle.

# effectsAndAnimationsHardSkillTitle
source: Effects and Animations
fi: Tehosteet ja animaatiot

# effectsAndAnimationsHardSkillBody
source: Have crafted captivating user experiences through the development and seamless integration of animations and transition effects within apps. Leveraging the versatile <link href="https://rive.app/">Rive</link> animation format, which supports the import of <link href="https://lottiefiles.com/">Lottie</link> animations and allows for interactive animations. Feel free to explore these interactions firsthand in the next card by simply clicking on it or hovering your mouse cursor over it.
fi: Olen luonut vangitsevia käyttäjäkokemuksia kehittämällä ja saumattomasti integroimalla animaatioita ja siirtymäefektejä sovelluksiin. Hyödynnän monipuolista <link href="https://rive.app/">Rive</link>-animaatioformaattia, joka tukee <link href="https://lottiefiles.com/">Lottie</link>-animaatioiden tuontia ja interaktiivisten animaatioiden luontia. Voit tutkia näitä vuorovaikutuksia ensikäden kokemuksella seuraavassa kortissa napsauttamalla sitä tai liikuttamalla hiiren kursoria sen yli.

# appDeploymentHardSkillTitle
source: App Deployment
fi: Sovelluksen julkaisu

# appDeploymentHardSkillBody
source: Experience with deploying Flutter apps to the Google Play Store and Apple App Store, including code signing and release management, and leveraging the <link href="https://fastlane.tools/">fastlane.tools</link> to streamline and automate the deployment process, ensuring seamless and consistent delivery of app updates to both platforms.
fi: Kokemusta Flutter-sovellusten julkaisemisesta Google Play -kauppaan ja Apple App Storeen, mukaan lukien koodin allekirjoitus ja julkaisun hallinta. Käytetty <link href="https://fastlane.tools/">fastlane.tools</link>-työkalua prosessin virtaviivaistamiseen ja automatisointiin, varmistaen sovelluspäivitysten saumattoman ja yhtenäisen toimittamisen molemmille alustoille.

# emailTitle
source: Email
fi: Sähköposti

# softSkillProblemSolvingBody
source: I excel at analyzing complex issues and formulating innovative solutions through a methodical approach, combining critical thinking with a knack for thinking outside the box.
fi: Osaan erinomaisesti analysoida monimutkaisia ongelmia ja laatia innovatiivisia ratkaisuja järjestelmällisen lähestymistavan avulla yhdistämällä kriittistä ajattelua kykyyn ajatella laatikon ulkopuolella.

# softSkillAdaptabilityBody
source: I thrive in dynamic environments, swiftly adjusting my strategies to meet evolving challenges, and embracing change as an opportunity for growth and learning.
fi: Kukoistan dynaamisissa ympäristöissä, mukautan strategioitani nopeasti vastaamaan muuttuvia haasteita ja omaksun muutoksen mahdollisuutena kasvuun ja oppimiseen.

# softSkillCommunicationBody
source: With a strong ability to articulate ideas clearly and listen actively, I foster effective collaboration and ensure that all stakeholders are well-informed and engaged in the discourse.
fi: Vahvan kyvyni ilmaista ideoita selkeästi ja kuunnella aktiivisesti edistää tehokasta yhteistyötä ja varmistan, että kaikki sidosryhmät ovat hyvin informoituja ja osallistuneita keskusteluun.

# softSkillTeamworkBody
source: Recognizing the strength of diverse perspectives, I actively contribute my skills while also valuing and integrating the contributions of others, thereby creating a harmonious and productive team environment.
fi: Tunnustaen monipuolisten näkökulmien voiman osallistun aktiivisesti taitojeni tuomiseen esiin ja arvostan sekä integroin muiden panosta, luoden näin harmonisen ja tuottavan tiimi-ilmapiirin.

# softSkillTimeManagementBody
source: I adeptly organize and prioritize tasks to meet deadlines without compromising quality, ensuring efficient workflows and consistently delivering results.
fi: Järjestän ja priorisoin tehtäviä taitavasti täyttääkseni määräajat tinkimättä laadusta, varmistaen tehokkaat työnkulut ja johdonmukaisesti tuottavat tulokset.

# softSkillCreativityBody
source: I harness my imaginative thinking to develop original concepts and approaches, enriching projects with fresh ideas that stand out and captivate audiences.
fi: Hyödynnän mielikuvituksellista ajatteluani kehittääkseni alkuperäisiä käsitteitä ja lähestymistapoja, rikastuttaen projekteja tuoreilla ideoilla, jotka erottuvat ja vangitsevat yleisön huomion.

# softSkillAttentionToDetailBody
source: Meticulous and thorough in my work, I meticulously attend to even the smallest elements, upholding a standard of excellence and delivering precision-driven outcomes.
fi: Tarkkaavainen ja perusteellinen työssäni, kiinnitän huolellisesti huomiota jopa pienimpiin yksityiskohtiin, ylläpitäen erinomaisuuden tasoa ja tuottaen tarkkuusvetoisia tuloksia.

# softSkillInitiativeBody
source: I proactively identify opportunities for improvement and take the lead in implementing effective strategies, demonstrating a strong drive to exceed expectations and make a meaningful impact.
fi: Tunnistan aloitteellisesti parannusmahdollisuudet ja otan johdon tehokkaiden strategioiden toteuttamisessa, osoittaen vahvaa pyrkimystä ylittää odotukset ja tehdä merkityksellinen vaikutus.

# softSkillOpenMindednessBody
source: Embracing diverse perspectives and alternative viewpoints, I foster an inclusive environment that encourages the exploration of new ideas and promotes innovative thinking.
fi: Omaksuen monipuoliset näkökulmat ja vaihtoehtoiset näkemykset, edistän inklusiivista ympäristöä, joka rohkaisee uusien ideoiden tutkimista ja edistää innovatiivista ajattelua.
